cf_billing/AccumulationRegisters/энргНачисленныйСреднийОбъем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргНачисленныйСреднийОбъем</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленныйПотери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонДифференцированногоТарифа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДиапазоныДифференцированныхТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗависимаяТочкаУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборЗависимой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СверхНорматива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргНачисленныйСреднийОбъем/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ДополнительныеСвойства.Свойство("ДанныеНабораДоЗаписи") Тогда
		Для Каждого СтрокаНабораДоЗаписи Из ДополнительныеСвойства.ДанныеНабораДоЗаписи Цикл
			
			СтрокаНабора  					= ЭтотОбъект.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаНабораДоЗаписи);
			СтрокаНабора.ОбъемУслуги 						= -СтрокаНабора.ОбъемУслуги;
			СтрокаНабора.ОбъемУслугиПотери 					= -СтрокаНабора.ОбъемУслугиПотери;
			СтрокаНабора.ОбъемУслугиПотребленный 			= -СтрокаНабора.ОбъемУслугиПотребленный;
			СтрокаНабора.ОбъемУслугиПотребленныйПотери 		= -СтрокаНабора.ОбъемУслугиПотребленныйПотери;			
			СтрокаНабора.Сумма 								= -СтрокаНабора.Сумма;
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|" + энргНачисления.СформироватьСтрокуДляЗапроса("энргНачисленныйСреднийОбъем","ДанныеНабора","",Истина,Истина) + "
		|ПОМЕСТИТЬ ДанныеНабора
		|ИЗ
		|	&ДанныеНабора КАК ДанныеНабора
		|;		
		|ВЫБРАТЬ
		|	ДанныеНабора.Организация КАК Организация,
		|	ДанныеНабора.Район КАК Район,
		|	ДанныеНабора.ЧастныйСектор КАК ЧастныйСектор,
		|	ДанныеНабора.Строение КАК Строение,
		|	ДанныеНабора.Помещение КАК Помещение,
		|	ДанныеНабора.Абонент КАК Абонент,
		|	ДанныеНабора.ПериодНачисления КАК ПериодНачисления,
		|	ДанныеНабора.ТочкаУчета КАК ТочкаУчета,
		|	ДанныеНабора.Услуга КАК Услуга,
		|	ДанныеНабора.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
		|	ДанныеНабора.ЗначениеТарифа КАК ЗначениеТарифа,
		|	ДанныеНабора.ПриборУчета КАК ПриборУчета,
		|	ДанныеНабора.Шкала КАК Шкала,
		|	ДанныеНабора.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ДанныеНабора.Поставщик КАК Поставщик,
		|	ДанныеНабора.ЗависимаяТочкаУчета КАК ЗависимаяТочкаУчета,
		|	ДанныеНабора.ПриборЗависимой КАК ПриборЗависимой,
		|	ДанныеНабора.СпособНачисления КАК СпособНачисления,
		|	ДанныеНабора.СверхНорматива КАК СверхНорматива,
		|	ДанныеНабора.ТарифнаяГруппа КАК ТарифнаяГруппа,
		|	СУММА(ДанныеНабора.ОбъемУслуги) КАК ОбъемУслуги,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотери) КАК ОбъемУслугиПотери,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотребленный) КАК ОбъемУслугиПотребленный,
		|	СУММА(ДанныеНабора.ОбъемУслугиПотребленныйПотери) КАК ОбъемУслугиПотребленныйПотери,
		|	СУММА(ДанныеНабора.Сумма) КАК Сумма
		|ИЗ
		|	ДанныеНабора КАК ДанныеНабора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеНабора.Организация,
		|	ДанныеНабора.Район,
		|	ДанныеНабора.ЧастныйСектор,
		|	ДанныеНабора.Строение,
		|	ДанныеНабора.Помещение,
		|	ДанныеНабора.Абонент,
		|	ДанныеНабора.ПериодНачисления,
		|	ДанныеНабора.ТочкаУчета,
		|	ДанныеНабора.Услуга,
		|	ДанныеНабора.НаправлениеИспользованияТУ,
		|	ДанныеНабора.ЗначениеТарифа,
		|	ДанныеНабора.ПриборУчета,
		|	ДанныеНабора.Шкала,
		|	ДанныеНабора.ТарифнаяЗона,
		|	ДанныеНабора.Поставщик,
		|	ДанныеНабора.ЗависимаяТочкаУчета,
		|	ДанныеНабора.ПриборЗависимой,
		|	ДанныеНабора.СпособНачисления,
		|	ДанныеНабора.СверхНорматива,
		|	ДанныеНабора.ТарифнаяГруппа
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ДанныеНабора.ОбъемУслуги) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотери) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотребленный) <> 0
		|		ИЛИ СУММА(ДанныеНабора.ОбъемУслугиПотребленныйПотери) <> 0
		|		ИЛИ СУММА(ДанныеНабора.Сумма) <> 0)";
		
		Запрос.УстановитьПараметр("ДанныеНабора", ЭтотОбъект.Выгрузить());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			ЭтотОбъект.Очистить();
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти
